
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>云迁移策略 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.1.1" data-path="cloud-migration-6r.html">
            
                <a href="cloud-migration-6r.html">
            
                    
                    云迁移策略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >云迁移策略</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E91;&#x8FC1;&#x79FB;&#x7B56;&#x7565;">&#x4E91;&#x8FC1;&#x79FB;&#x7B56;&#x7565;</h1>
<p>&#x4E91;&#x8BA1;&#x7B97;&#x7ECF;&#x8FC7;&#x591A;&#x5E74;&#x7684;&#x4EA7;&#x54C1;&#x80FD;&#x529B;&#x5B8C;&#x5584;&#x3001;&#x4E91;&#x4EA7;&#x54C1;&#x6301;&#x7EED;&#x65B0;&#x589E;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x9010;&#x6B65;&#x589E;&#x5F3A;&#xFF0C;&#x4F7F;&#x5F97;&#x5927;&#x5BB6;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x7406;&#x5FF5;&#x5E76;&#x79EF;&#x6781;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5728;&#x81EA;&#x8EAB;&#x4E1A;&#x52A1;&#x4E2D;&#x4F7F;&#x7528;&#x4E91;&#x8BA1;&#x7B97;&#x3002;</p>
<h2 id="&#x5236;&#x5B9A;&#x8FC1;&#x79FB;&#x7B56;&#x7565;">&#x5236;&#x5B9A;&#x8FC1;&#x79FB;&#x7B56;&#x7565;</h2>
<p>&#x4F01;&#x4E1A;&#x901A;&#x5E38;&#x5728;&#x201C;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x201D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x9636;&#x6BB5;&#x200A; (&#x4EA7;&#x54C1;&#x7EC4;&#x5408;&#x53D1;&#x73B0;&#x548C;&#x89C4;&#x5212;) &#x5F00;&#x59CB;&#x8003;&#x8651;&#x5982;&#x4F55;&#x8FC1;&#x79FB;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x6B64;&#x65F6;&#x4F01;&#x4E1A;&#x4F1A;&#x786E;&#x5B9A;&#x5176;&#x73AF;&#x5883;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3001;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x6027;&#x3001;&#x54EA;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BB9;&#x6613;&#x8FC1;&#x79FB;&#x3001;&#x54EA;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x96BE;&#x4EE5;&#x8FC1;&#x79FB;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x8FC1;&#x79FB;&#x5404;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#xFF0C;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x8349;&#x62DF;&#x51FA;&#x4E00;&#x4E2A;&#x65B9;&#x6848; (&#x5728;&#x8FC1;&#x79FB;&#x548C;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x5176;&#x4F1A;&#x53D7;&#x5230;&#x54EA;&#x4E9B;&#x53D8;&#x66F4;&#x7684;&#x5F71;&#x54CD;)&#xFF0C;&#x4E86;&#x89E3;&#x5C06;&#x5982;&#x4F55;&#x8FC1;&#x79FB;&#x5176;&#x4EA7;&#x54C1;&#x7EC4;&#x5408;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x53CA;&#x4EE5;&#x4F55;&#x79CD;&#x987A;&#x5E8F;&#x8FC1;&#x79FB;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x73B0;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x590D;&#x6742;&#x6027;&#x56E0;&#x67B6;&#x6784;&#x548C;&#x73B0;&#x6709;&#x7684;&#x8BB8;&#x53EF;&#x5B89;&#x6392;&#x800C;&#x6709;&#x6240;&#x4E0D;&#x540C;,&#x5EFA;&#x8BAE;&#x4ECE;&#x590D;&#x6742;&#x5EA6;&#x8F83;&#x4F4E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x8FC1;&#x79FB;&#xFF0C;&#x7406;&#x7531;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5373;&#x8FC1;&#x79FB;&#x66F4;&#x5BB9;&#x6613;&#x5B8C;&#x6210;&#x200A;&#x2014;&#x200A;&#x8FD9;&#x5C06;&#x5728;&#x60A8;&#x5B66;&#x4E60;&#x65F6;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x76F4;&#x63A5;&#x7684;&#x6B63;&#x9762;&#x5F3A;&#x5316;&#x6548;&#x679C; (&#x5373;&#x201C;&#x901F;&#x6548;&#x65B9;&#x6848;&#x201D;)&#x3002;</p>
<h2 id="6&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8FC1;&#x79FB;&#x7B56;&#x7565;">6&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8FC1;&#x79FB;&#x7B56;&#x7565;</h2>
<p>&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x8FC1;&#x79FB;&#x4E0A;&#x4E91;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;2011&#x5E74; Gartner &#x7684;&#x5206;&#x6790;&#x5E08;&#x63D0;&#x51FA;&#x4E86; 5R &#x7B56;&#x7565;&#xFF0C;&#x968F;&#x7740;&#x540E;&#x7EED;&#x7684;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#x548C;&#x8865;&#x5145;&#xFF0C;&#x76EE;&#x524D;&#x8FC1;&#x79FB;&#x4E0A;&#x4E91;&#x7684;&#x7B56;&#x7565;&#x88AB;&#x4E00;&#x822C;&#x8BA4;&#x4E3A;&#x4E3A; 6R &#x7B56;&#x7565;&#xFF0C;&#x5373;&#x672C;&#x6587;&#x5C06;&#x8981;&#x4ECB;&#x7ECD;&#x7684;&#x516D;&#x79CD;&#x4E91;&#x8FC1;&#x79FB;&#x7B56;&#x7565;&#x3002;</p>
<p><img src="images/m6r-detailed-view.png" alt="Six Common Migration Strategies: Detailed View Diagram"></p>
<h3 id="rehost-&#x91CD;&#x65B0;&#x6258;&#x7BA1;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;-&#x76F4;&#x63A5;&#x8FC1;&#x79FB;">Rehost &#x91CD;&#x65B0;&#x6258;&#x7BA1;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A; &#x201C;&#x76F4;&#x63A5;&#x8FC1;&#x79FB;&#x201D;</h3>
<p>&#x8FD9;&#x4E2A;&#x662F;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x4E91;&#x8FC1;&#x79FB;&#x65F6;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5373;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E0D;&#x505A;&#x6539;&#x53D8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FC1;&#x79FB;&#x4E0A;&#x4E91;&#xFF0C; &#x4E00;&#x822C;&#x7684;&#x64CD;&#x4F5C;&#x662F; P2V&#xFF08;Physical to Virtual&#xFF0C;&#x7269;&#x7406;&#x673A;&#x8FC1;&#x79FB;&#x81F3;&#x865A;&#x62DF;&#x673A;&#xFF09;&#x3001;V2V&#xFF08;Virtual to Virtual&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x8FC1;&#x79FB;&#x81F3;&#x865A;&#x62DF;&#x673A;&#xFF09;&#x3002;&#x5728;&#x4F01;&#x4E1A;&#x671F;&#x671B;&#x5FEB;&#x901F;&#x4E0A;&#x4E91;&#x6216;&#x5927;&#x578B;&#x5E94;&#x7528;&#x4E0A;&#x4E91;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x6BD4;&#x8F83;&#x5408;&#x9002;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x4E2D;</p>
<h3 id="replatform-&#x66F4;&#x6362;&#x5E73;&#x53F0;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;-&#x4FEE;&#x8865;&#x540E;&#x8FC1;&#x79FB;">Replatform &#x66F4;&#x6362;&#x5E73;&#x53F0;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A; &#x201C;&#x4FEE;&#x8865;&#x540E;&#x8FC1;&#x79FB;&#x201D;</h3>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4E91; (&#x6216;&#x5176;&#x4ED6;) &#x4F18;&#x5316;&#x4EE5;&#x83B7;&#x5F97;&#x4E00;&#x4E9B;&#x6709;&#x5F62;&#x7684;&#x6536;&#x76CA;&#xFF0C;&#x4F46;&#x60A8;&#x4E0D;&#x80FD;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6838;&#x5FC3;&#x67B6;&#x6784;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x7F29;&#x77ED;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x95F4;&#xFF1A;&#x8FC1;&#x79FB;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5373;&#x670D;&#x52A1;&#x5E73;&#x53F0;&#xFF0C;&#x5982;RDS&#xFF08;Relational Database Service&#xFF09;&#xFF0C;&#x6216;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FC1;&#x79FB;&#x5230;&#x5B8C;&#x5168;&#x6258;&#x7BA1;&#x7684;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x4E00;&#x5BB6;&#x5927;&#x578B;&#x5A92;&#x4F53;&#x516C;&#x53F8;&#x5C06;&#x5176;&#x5728;&#x672C;&#x5730;&#x8FD0;&#x884C;&#x7684;&#x6570;&#x767E;&#x4E2A; Web &#x670D;&#x52A1;&#x8FC1;&#x79FB;&#x5230;&#x4E86;&#x4E91;&#x4E0A;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x4ECE; WebLogic (&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x4EF7;&#x683C;&#x9AD8;&#x6602;&#x7684;&#x8BB8;&#x53EF;&#x8BC1;&#x7684; Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BB9;&#x5668;) &#x8FC1;&#x79FB;&#x5230;&#x4E86; Apache Tomcat (&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x7B49;&#x6548;&#x5BB9;&#x5668;)&#x3002;&#x9664;&#x4E86;&#x4ECE;&#x8FC1;&#x79FB;&#x5230;&#x4E91;&#x4E0A;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x6210;&#x672C;&#x8282;&#x7701;&#x548C;&#x654F;&#x6377;&#x6027;&#xFF0C;&#x8FD9;&#x5BB6;&#x5A92;&#x4F53;&#x516C;&#x53F8;&#x8FD8;&#x8282;&#x7EA6;&#x4E86;&#x6570;&#x767E;&#x4E07;&#x5143;&#x7684;&#x8BB8;&#x53EF;&#x6210;&#x672C;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x9AD8;</p>
<h3 id="repurchase-&#x91CD;&#x65B0;&#x8D2D;&#x7F6E;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;-&#x653E;&#x5F03;&#x540E;&#x8D2D;&#x4E70;">Repurchase &#x91CD;&#x65B0;&#x8D2D;&#x7F6E;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A; &#x201C;&#x653E;&#x5F03;&#x540E;&#x8D2D;&#x4E70;&#x201D;</h3>
<p>&#x662F;&#x6307;&#x653E;&#x5F03;&#x4F7F;&#x7528;&#x539F;&#x5148;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x6539;&#x4E3A;&#x91C7;&#x8D2D;&#x65B0;&#x7684;&#x66FF;&#x4EE3;&#x4EA7;&#x54C1;&#xFF0C;&#x4F8B;&#x5982;&#x539F;&#x5148;&#x4F01;&#x4E1A;&#x91C7;&#x7528;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x8BB8;&#x53EF;&#x6A21;&#x5F0F;&#x7684;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x653E;&#x5F03;&#x5E76;&#x9009;&#x7528;&#x540C;&#x7C7B; SaaS &#x4EA7;&#x54C1;&#x6765;&#x8FDB;&#x884C;&#x66FF;&#x6362;&#xFF0C;&#x6291;&#x6216;&#x662F;&#x9009;&#x7528;&#x4E86;&#x8BE5;&#x5382;&#x5546;&#x7684; SaaS &#x7248;&#x672C;&#x3002;</p>
<p>&#x5982;&#x5C06; CRM &#x8FC1;&#x79FB;&#x5230; Salesforce.com&#xFF0C;&#x5C06; HR &#x7CFB;&#x7EDF;&#x8FC1;&#x79FB;&#x5230; Workday&#xFF0C;&#x5C06; CMS &#x8FC1;&#x79FB;&#x5230; Drupal&#xFF0C;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;</p>
<p>&#x8FC1;&#x79FB;&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x4E2D;</p>
<h3 id="refactor-&#x91CD;&#x6784;&#x91CD;&#x65B0;&#x6784;&#x5EFA;">Refactor &#x91CD;&#x6784;/&#x91CD;&#x65B0;&#x6784;&#x5EFA;</h3>
<p>&#x6539;&#x53D8;&#x5E94;&#x7528;&#x7684;&#x67B6;&#x6784;&#x548C;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#xFF0C;&#x8FDB;&#x884C;&#x4E91;&#x539F;&#x751F;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x5411;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6539;&#x9020;&#xFF0C;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x4E00;&#x822C;&#x662F;&#x5728;&#x73B0;&#x6709;&#x5E94;&#x7528;&#x73AF;&#x5883;&#x4E0B;&#x96BE;&#x4EE5;&#x6EE1;&#x8DB3;&#x65E5;&#x540E;&#x529F;&#x80FD;&#x3001;&#x6027;&#x80FD;&#x6216;&#x89C4;&#x6A21;&#x4E0A;&#x7684;&#x9700;&#x6C42;&#x65F6;&#x91C7;&#x7528;&#xFF0C;&#x8BE5;&#x7B56;&#x7565;&#x7684;&#x8FC1;&#x79FB;&#x6210;&#x672C;&#x6700;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x957F;&#x8FDC;&#x6765;&#x770B;&#x4F1A;&#x66F4;&#x4E3A;&#x6EE1;&#x8DB3;&#x672A;&#x6765;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x8FC1;&#x79FB;&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x9AD8;</p>
<h3 id="retain-&#x4FDD;&#x7559;">Retain &#x4FDD;&#x7559;</h3>
<p>&#x5728;&#x90E8;&#x5206;&#x5E94;&#x7528;&#x6216;&#x8005;&#x4E1A;&#x52A1;&#x672A;&#x505A;&#x597D;&#x4E0A;&#x4E91;&#x51C6;&#x5907;&#xFF0C;&#x6216;&#x662F;&#x66F4;&#x4E3A;&#x9002;&#x5408;&#x672C;&#x5730;&#x90E8;&#x7F72;&#x65F6;&#xFF0C;&#x4FDD;&#x7559;&#x73B0;&#x72B6;&#xFF0C;&#x4E0D;&#x5F3A;&#x884C;&#x8FDB;&#x884C;&#x8FC1;&#x79FB;&#x4E0A;&#x4E91;&#x64CD;&#x4F5C;&#x3002;</p>
<h3 id="retire-&#x505C;&#x7528;">Retire &#x505C;&#x7528;</h3>
<p>&#x786E;&#x5B9A;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x8868;&#x660E;&#x8FD9;&#x90E8;&#x5206;&#x7CFB;&#x7EDF;&#x6216;&#x5E94;&#x7528;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x4EF7;&#x503C;&#x4E14;&#x8FD8;&#x5728;&#x6301;&#x7EED;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#xFF0C;&#x5E94;&#x8BE5;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x5F52;&#x6863;&#x5907;&#x4EFD;&#x540E;&#x505C;&#x7528;&#x3002;</p>
<h2 id="&#x5C55;&#x671B;">&#x5C55;&#x671B;</h2>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x5E94;&#x7528;&#x8FC1;&#x79FB;&#x9700;&#x8981;&#x76F8;&#x5E94;&#x7684;&#x7B56;&#x7565;&#x3002;&#x5E94;&#x7528;&#x8FC1;&#x79FB;&#x8BE5;&#x6709;&#x4F18;&#x5148;&#x7EA7;&#x8BBE;&#x5B9A;&#xFF0C;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x53D1;&#x5C55;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x6765;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x8FC1;&#x79FB;&#x5177;&#x6709;&#x5176;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x7684;&#x53C2;&#x4E0E;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"云迁移策略","level":"1.1.1","depth":2,"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[{"title":"云迁移策略","level":"1.1.1","depth":2,"path":"cloud-migration-6r.md","ref":"./cloud-migration-6r.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"cloud-migration-6r.md","mtime":"2020-01-29T10:15:09.782Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-29T10:16:23.976Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

